is1200-example-projects/mcb32tools/headers/proc/p32mz1024ecm144.h
extern volatile __CNCONGbits_t CNCONGbits __asm__ ("CNCONG") __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONGCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONGSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONGINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNENG __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNIEG0:1;
    unsigned CNIEG1:1;
    unsigned :4;
    unsigned CNIEG6:1;
    unsigned CNIEG7:1;
    unsigned CNIEG8:1;
    unsigned CNIEG9:1;
    unsigned :2;
    unsigned CNIEG12:1;
    unsigned CNIEG13:1;
    unsigned CNIEG14:1;
    unsigned CNIEG15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENGbits_t;
extern volatile __CNENGbits_t CNENGbits __asm__ ("CNENG") __attribute__((section("sfrs")));
extern volatile unsigned int        CNENGCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNENGSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNENGINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATG __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNSTATG0:1;
    unsigned CNSTATG1:1;
    unsigned :4;
    unsigned CNSTATG6:1;
    unsigned CNSTATG7:1;
    unsigned CNSTATG8:1;
    unsigned CNSTATG9:1;
    unsigned :2;
    unsigned CNSTATG12:1;
    unsigned CNSTATG13:1;
    unsigned CNSTATG14:1;
    unsigned CNSTATG15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATGbits_t;
extern volatile __CNSTATGbits_t CNSTATGbits __asm__ ("CNSTATG") __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATGCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATGSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATGINV __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELH __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ANSH0:1;
    unsigned ANSH1:1;
    unsigned :2;
    unsigned ANSH4:1;
    unsigned ANSH5:1;
    unsigned ANSH6:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELHbits_t;
extern volatile __ANSELHbits_t ANSELHbits __asm__ ("ANSELH") __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELHCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELHSET __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELHINV __attribute__((section("sfrs")));
extern volatile unsigned int        TRISH __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TRISH0:1;
    unsigned TRISH1:1;
    unsigned TRISH2:1;
    unsigned TRISH3:1;
    unsigned TRISH4:1;
    unsigned TRISH5:1;
    unsigned TRISH6:1;
    unsigned TRISH7:1;
    unsigned TRISH8:1;
    unsigned TRISH9:1;
    unsigned TRISH10:1;
    unsigned TRISH11:1;
    unsigned TRISH12:1;
    unsigned TRISH13:1;
    unsigned TRISH14:1;
    unsigned TRISH15:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISHbits_t;
extern volatile __TRISHbits_t TRISHbits __asm__ ("TRISH") __attribute__((section("sfrs")));
extern volatile unsigned int        TRISHCLR __attribute__((section("sfrs")));
extern volatile unsigned int        TRISHSET __attribute__((section("sfrs")));
extern volatile unsigned int        TRISHINV __attribute__((section("sfrs")));
extern volatile unsigned int        PORTH __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RH0:1;
    unsigned RH1:1;
    unsigned RH2:1;
    unsigned RH3:1;
    unsigned RH4:1;
    unsigned RH5:1;
    unsigned RH6:1;
    unsigned RH7:1;
    unsigned RH8:1;
    unsigned RH9:1;
    unsigned RH10:1;
    unsigned RH11:1;
    unsigned RH12:1;
    unsigned RH13:1;
    unsigned RH14:1;
    unsigned RH15:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTHbits_t;
extern volatile __PORTHbits_t PORTHbits __asm__ ("PORTH") __attribute__((section("sfrs")));
extern volatile unsigned int        PORTHCLR __attribute__((section("sfrs")));
extern volatile unsigned int        PORTHSET __attribute__((section("sfrs")));
extern volatile unsigned int        PORTHINV __attribute__((section("sfrs")));
extern volatile unsigned int        LATH __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned LATH0:1;
    unsigned LATH1:1;
    unsigned LATH2:1;
    unsigned LATH3:1;
    unsigned LATH4:1;
    unsigned LATH5:1;
    unsigned LATH6:1;
    unsigned LATH7:1;
    unsigned LATH8:1;
    unsigned LATH9:1;
    unsigned LATH10:1;
    unsigned LATH11:1;
    unsigned LATH12:1;
    unsigned LATH13:1;
    unsigned LATH14:1;
    unsigned LATH15:1;
  };
  struct {
    unsigned w:32;
  };
} __LATHbits_t;
extern volatile __LATHbits_t LATHbits __asm__ ("LATH") __attribute__((section("sfrs")));
extern volatile unsigned int        LATHCLR __attribute__((section("sfrs")));
extern volatile unsigned int        LATHSET __attribute__((section("sfrs")));
extern volatile unsigned int        LATHINV __attribute__((section("sfrs")));
extern volatile unsigned int        ODCH __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ODCH0:1;
    unsigned ODCH1:1;
    unsigned ODCH2:1;
    unsigned ODCH3:1;
    unsigned ODCH4:1;
    unsigned ODCH5:1;
    unsigned ODCH6:1;
    unsigned ODCH7:1;
    unsigned ODCH8:1;
    unsigned ODCH9:1;
    unsigned ODCH10:1;
    unsigned ODCH11:1;
    unsigned ODCH12:1;
    unsigned ODCH13:1;
    unsigned ODCH14:1;
    unsigned ODCH15:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCHbits_t;
extern volatile __ODCHbits_t ODCHbits __asm__ ("ODCH") __attribute__((section("sfrs")));
extern volatile unsigned int        ODCHCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ODCHSET __attribute__((section("sfrs")));
extern volatile unsigned int        ODCHINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUH __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNPUH0:1;
    unsigned CNPUH1:1;
    unsigned CNPUH2:1;
    unsigned CNPUH3:1;
    unsigned CNPUH4:1;
    unsigned CNPUH5:1;
    unsigned CNPUH6:1;
    unsigned CNPUH7:1;
    unsigned CNPUH8:1;
    unsigned CNPUH9:1;
    unsigned CNPUH10:1;
    unsigned CNPUH11:1;
    unsigned CNPUH12:1;
    unsigned CNPUH13:1;
    unsigned CNPUH14:1;
    unsigned CNPUH15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUHbits_t;
